doom/config.org
#+TITLE: Doom Config
#+AUTHOR: Hai Nguyen
#+STARTUP: overview

* General Configuration
** Always ensure package

#+begin_src emacs-lisp
(require 'use-package-ensure)
(setq use-package-always-ensure t)
#+end_src

* User Interface Settings
** Make ESC quit promps

#+begin_src emacs-lisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Menu Bar

#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Theme

#+begin_src emacs-lisp
(use-package doom-themes)
(setq doom-themes-enable-bold t
    doom-themes-enable-italics t)
(load-theme 'doom-outrun-electric t)
#+end_src

** Modeline

#+begin_src emacs-lisp
(use-package doom-modeline)
(doom-modeline-mode 1)
#+end_src

** Line Numbers and Truncated Lines
show absolute line numbers and highlight current line number
#+begin_src emacs-lisp
(global-display-line-numbers-mode)
#+end_src

#+RESULTS:
: t

disable line numbers for some modes
#+begin_src emacs-lisp
(dolist (mode '(term-mode-hook
        eshell-mode-hook))
    (add-hook mode (lambda() (display-line-numbers-mode 0))))

#+end_src

** Truncate lines
remove emacs' default line wrap
#+begin_src emacs-lisp
(set-default 'truncate-lines t)
#+end_src

** Indentation
#+begin_src emacs-lisp
(setq indent-tabs-mode t)
(setq tab-stop-list (number-sequence 8 200 8))
(setq tab-width 4)
(setq indent-line-function 'insert-tab)
#+end_src


** Tab
** Line Highlighting
remove emacs' default line wrap
#+begin_src emacs-lisp
(global-hl-line-mode +1)
(use-package hlinum)
(hlinum-activate)
#+end_src

** Rainbow Delimiter
color (),[],{} as pair
#+begin_src emacs-lisp
(use-package rainbow-delimiters
:hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Scrolling

#+begin_src emacs-lisp
(setq scroll-step 1)
(setq scroll-conservatively 10000)
#+end_src

** Fonts

#+begin_src emacs-lisp
(set-face-attribute 'default nil
    :font "Noto Sans Mono 11"
    :weight 'medium)
(set-face-attribute 'variable-pitch nil
	:font "Noto Sans Mono 11"
    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
    :font "Noto Sans Mono 11"
    :weight 'medium)
;;(setq-default line-spacing 0.10)
(add-to-list 'default-frame-alist '(font . "Noto Sans Mono 11"))
#+end_src

*** Zooming in/out keybindings

#+begin_src emacs-lisp
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

** Pretty Math Symbol

#+begin_src emacs-lisp
(setq org-pretty-entities t)
#+end_src

* General Packages
** keybinding packages
*** key-chord
#+begin_src emacs-lisp
(use-package key-chord)
#+end_src

*** Which Key
display key functions
  #+begin_src emacs-lisp
(use-package which-key)
(which-key-mode)
  #+end_src

*** General

#+begin_src emacs-lisp
(use-package general
     :config
(general-evil-setup t))
#+end_src

**** set space and C-SPC as global prefix

#+begin_src emacs-lisp
(general-create-definer space-leader
    :states '(normal visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "C-SPC"
)
#+end_src

** Auto Completion Engines
*** Ivy

#+begin_src emacs-lisp
(use-package ivy
    :diminish
    :bind (("C-s" . swiper)
            :map ivy-minibuffer-map
            ("TAB" . ivy-alt-done)
            ("C-l" . ivy-alt-done)
            ("C-j" . ivy-next-line)
            ("C-k" . ivy-previous-line)
            :map ivy-switch-buffer-map
            ("C-k" . ivy-previous-line)
            ("C-l" . ivy-done)
            ("C-d" . ivy-switch-buffer-kill)
            :map ivy-reverse-i-search-map
            ("C-k" . ivy-previous-line)
            ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))
#+end_src

*** Ivy Rich

#+begin_src emacs-lisp
(use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

*** Counsel

#+begin_src emacs-lisp
(use-package counsel
:bind (("M-x" . counsel-M-x)
        ("C-x b" . counsel-ibuffer)
        ("C-x C-f" . counsel-find-file)
        :map minibuffer-local-map
        ("C-r" . 'counsel-minibuffer-history)))
#+end_src

*** Company

#+begin_src emacs-lisp
(use-package company)
(add-hook 'after-init-hook 'global-company-mode)
#+end_src

*** Electric
**** Indentation

#+begin_src emacs-lisp
(add-hook 'after-init-hook 'electric-indent-mode)

#+end_src

**** parenthesis

#+begin_src emacs-lisp
(add-hook 'after-init-hook 'electric-pair-mode)
(setq electric-pair-preserve t)
(show-paren-mode 1)
(setq show-paren-delay 0)
#+end_src

** Japanese input method
| command | description                             |
|---------+-----------------------------------------|
| ctrl+\  | toggle japanese input method            |
| K       | toggle katakana when inputting hiragana |
| space   | move between kanji option               |

#+begin_src emacs-lisp
(setq default-input-method "japanese")
#+end_src

** Dashboard

*** Configuration
#+begin_src emacs-lisp
(use-package dashboard
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
  ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as bannerj
  (setq dashboard-startup-banner "~/.config/emacs/emacs-dash.png")  ;; use custom image as banner
  (setq dashboard-center-content nil) ;; set to 't' for centered content
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
			      (bookmarks . "book"))))
#+end_src


*** Dashboard in Emacsclient

#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

** Perspective

#+begin_src emacs-lisp
(use-package perspective
:bind
("C-x C-b" . persp-list-buffers)
:config
(persp-mode)
)
#+end_src

** Dired
instantly update dired
#+begin_src emacs-lisp
(add-hook 'dired-mode-hook 'auto-revert-mode)
#+end_src

#+begin_src emacs-lisp
(use-package all-the-icons-dired)
(use-package dired-open)
(use-package peep-dired)

(space-leader
    "d d" '(dired :which-key "Open dired")
    "d j" '(dired-jump :which-key "Dired jump to current")
    "d p" '(peep-dired :which-key "Peep-dired"))

(defun fix-peep-dired-next-file()
(interactive)
(delete-other-windows)
(peep-dired-next-file))

(defun fix-peep-dired-prev-file()
(interactive)
(delete-other-windows)
(peep-dired-prev-file))

(with-eval-after-load 'dired
(general-define-key
:states '(normal, visual)
:keymaps 'dired-mode-map
"h" 'dired-up-directory
"l" 'dired-find-file)

(general-define-key
:states '(normal, visual)
:keymaps 'peep-dired-mode-map
"j" 'fix-peep-dired-next-file
"k" 'fix-peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "mpv")
                              ("pdf" . "zathura")
                              ("mp4" . "mpv")))
#+end_src

** Rainbow mode

show rgb color in emacs
#+begin_src emacs-lisp
(use-package rainbow-mode)
#+end_src

** PDF
better pdf reader
#+begin_src emacs-lisp
(use-package pdf-tools
    :defer t
    :config
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-page)
)
#+end_src

** Projectile

#+begin_src emacs-lisp
(use-package projectile)
#+end_src

** All The Icons

#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

** Emacs Everywhere

#+begin_src emacs-lisp
(use-package emacs-everywhere)
#+end_src

** Sudo Edit

#+begin_src emacs-lisp
(use-package sudo-edit)
#+end_src

** Files
*** Keybindings

#+begin_src emacs-lisp
(space-leader
    "."     '(find-file :which-key "Find file")
    "f f"   '(find-file :which-key "Find file")
    "f r"   '(counsel-recentf :which-key "Recent files")
    "f s"   '(save-buffer :which-key "Save file")
    "f u"   '(sudo-edit-find-file :which-key "Sudo find file")
    "f y"   '(dt/show-and-copy-buffer-path :which-key "Yank file path")
    "f C"   '(copy-file :which-key "Copy file")
    "f D"   '(delete-file :which-key "Delete file")
    "f R"   '(rename-file :which-key "Rename file")
    "f S"   '(write-file :which-key "Save file as...")
    "f U"   '(sudo-edit :which-key "Sudo edit file"))
#+end_src

*** Opening specific file/folder

#+begin_src emacs-lisp
(space-leader
  "- a" '(lambda () (interactive)(find-file "~/orgfiles/agenda.org") :which-key "Org agenda")
  "- e" '(lambda () (interactive)(find-file "~/.config/doom/config.org") :which-key "Emacs Configuration")
  "- p" '(lambda () (interactive)(find-file "~/Documents/Projects") :which-key "Project Folder")
  "- c" '(lambda () (interactive)(find-file "~/Documents/Class/2021/fall/") :which-key "current class folder")
)
#+end_src

** Org Mode
*** Configuration

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(setq org-src-tab-acts-natively t
    org-src-preserve-indentation nil
    org-edit-src-content-indentation 0)
#+end_src

*** Org Bullets
Beautify your org bullets
#+begin_src emacs-lisp
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda() (org-bullets-mode 1)))
#+end_src

collapsed all org bullets globally
#+begin_src emacs-lisp
(setq org-startup-folded t)
#+end_src

*** Org Source Code Block

#+begin_src emacs-lisp
(setq org-src-fontify-natively t
    org-confirm-babel-evaluate nil)
#+end_src

*** Generate Table of Contents

#+begin_src emacs-lisp
(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** keybindings
#+begin_src emacs-lisp
(space-leader
       "m *"   '(org-ctrl-c-star :which-key "Org-ctrl-c-star")
       "m +"   '(org-ctrl-c-minus :which-key "Org-ctrl-c-minus")
       "m ."   '(counsel-org-goto :which-key "Counsel org goto")
       "m e"   '(org-export-dispatch :which-key "Org export dispatch")
       "m f"   '(org-footnote-new :which-key "Org footnote new")
       "m h"   '(org-toggle-heading :which-key "Org toggle heading")
       "m i"   '(org-toggle-item :which-key "Org toggle item")
       "m n"   '(org-store-link :which-key "Org store link")
       "m o"   '(org-set-property :which-key "Org set property")
       "m t"   '(org-todo :which-key "Org todo")
       "m x"   '(org-toggle-checkbox :which-key "Org toggle checkbox")
       "m B"   '(org-babel-tangle :which-key "Org babel tangle")
       "m I"   '(org-toggle-inline-images :which-key "Org toggle inline imager")
       "m T"   '(org-todo-list :which-key "Org todo list")
       "o a"   '(org-agenda :which-key "Org agenda")
       )
#+end_src

*** Latex Preview

#+begin_src emacs-lisp
(require 'org)
(setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
#+end_src

*** Visual Fill Mode

#+begin_src emacs-lisp
;; (defun efs/org-mode-visual-fill ()
;; (setq visual-fill-column-width 100
;; visual-fill-column-center-text t)
;; (visual-fill-column-mode 1))

;; (
;; use-package visual-fill-column
;; :hook (org-mode . efs/org-mode-visual-fill)
;; )
#+end_src

#+RESULTS:

*** Inline image

#+begin_src emacs-lisp
(setq org-startup-with-inline-images t)
#+end_src

** MU4E
MU4E is an emacs email client

#+begin_src emacs-lisp

#+end_src

** Yasnippet
Template system for Emacs
#+begin_src emacs-lisp
(use-package yasnippet)
(yas-global-mode 1)
#+end_src

*** Indent
#+begin_src emacs-lisp
(setq yas-indent-line nil)

#+end_src

** Language Support
*** Programming Languages

#+begin_src emacs-lisp
(use-package haskell-mode)
#+end_src

** Latex

#+begin_src emacs-lisp
(use-package auctex
:defer t)
#+end_src

** SHELLS
Settings for the various shells and terminal emulators within Emacs.
+ 'shell-file-name' -- sets the shell to be used in M-x shell, M-x term, M-x ansi-term and M-x vterm.
+ 'eshell-aliases-file' -- sets an aliases file for the eshell.

#+BEGIN_SRC emacs-lisp
(setq shell-file-name "/usr/bin/zsh"
      vterm-max-scrollback 5000)
#+END_SRC

** Emojis
Display Emoji in Emacs
#+begin_src emacs-lisp
(use-package emojify
    :hook (after-init . global-emojify-mode))
#+end_src

* Configuration
** Windows control
*** Split buffer side by side

#+begin_src emacs-lisp
(setq split-height-threshold nil)
(setq split-width-threshold 0)
#+end_src

*** Keybindings
#+begin_src emacs-lisp
(winner-mode 1)
(space-leader
       ;; Window splits
       "w c"   '(evil-window-delete :which-key "Close window")
       "w d"   '(evil-window-delete :which-key "Close window")
       "w o"   '(delete-other-windows :which-key "Delete other windows")
       "w n"   '(evil-window-new :which-key "New window")
       "w s"   '(evil-window-split :which-key "Horizontal split window")
       "w v"   '(evil-window-vsplit :which-key "Vertical split window")
       "w _"   '(evil-window-set-height :which-key "evil-window-set-height")
       "w |"   '(evil-window-set-width :which-key "evil-window-set-width")

       ;; Window motions
       "w h"   '(evil-window-left :which-key "Window left")
       "w j"   '(evil-window-down :which-key "Window down")
       "w k"   '(evil-window-up :which-key "Window up")
       "w l"   '(evil-window-right :which-key "Window right")
       "w w"   '(evil-window-next :which-key "Goto next window")
       ;; winner mode
       "w <left>"  '(winner-undo :which-key "Winner undo")
       "w <right>" '(winner-redo :which-key "Winner redo"))
#+end_src

** Registers

#+begin_src emacs-lisp
(space-leader
       "r c"   '(copy-to-register :which-key "Copy to register")
       "r f"   '(frameset-to-register :which-key "Frameset to register")
       "r i"   '(insert-register :which-key "Insert register")
       "r j"   '(jump-to-register :which-key "Jump to register")
       "r l"   '(list-registers :which-key "List registers")
       "r n"   '(number-to-register :which-key "Number to register")
       "r r"   '(counsel-register :which-key "Choose a register")
       "r v"   '(view-register :which-key "View a register")
       "r w"   '(window-configuration-to-register :which-key "Window configuration to register")
       "r +"   '(increment-register :which-key "Increment register")
       "r SPC" '(point-to-register :which-key "Point to register"))
#+end_src

** general Keybindings

#+begin_src emacs-lisp
(space-leader
  "SPC"   '(counsel-M-x :which-key "M-x")
  "c c"   '(compile :which-key "Compile")
  "c C"   '(recompile :which-key "Recompile")
  "t t"   '(toggle-truncate-lines :which-key "Toggle truncate lines"))
#+end_src
